# Cable Type Insulation Material Property

Source: https://www.revitapidocs.com/2026/a5e64eac-f684-0f2b-6ceb-23978e74c132.htm

---

| Cable Type Insulation Material Property |
| --- |

The Conductor Insulation Material of this Cable Type.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public ElementId InsulationMaterial { get; set; }
```

```
Public Property InsulationMaterial As ElementId
	Get
	Set
```

```
public:
property ElementId^ InsulationMaterial {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

```
member InsulationMaterial : ElementId with get, set
```

#### Property Value

ElementId Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The id is not a Conductor Insulation Material id nor invalidElementId. |
| ArgumentNullException | When setting this property: A non\-optional argument was null |

See Also

#### Reference

CableType Class Autodesk.Revit.DB.Electrical Namespace